КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиОрганизаций/КонтурЛогистика_НастройкиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиОрганизаций</name>
  <resources>
    <name>ЗначениеНастройки</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>String</types>
      <types>EnumRef.КонтурЛогистика_НастройкиОрганизацийДиадок</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_Аутентификация/КонтурЛогистика_Аутентификация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_Аутентификация</name>
  <resources>
    <name>ДатаОкончания</name>
    <comment>Местное время</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяЖизни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаОкончанияМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортальныйИд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_РежимыАвторизации/КонтурЛогистика_РежимыАвторизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_РежимыАвторизации</name>
  <enumValues>
    <name>ЛогинИПароль</name>
  </enumValues>
  <enumValues>
    <name>ApiKey</name>
  </enumValues>
  <enumValues>
    <name>ЛогинИПарольИApiKey</name>
  </enumValues>
  <enumValues>
    <name>OIDCDeviceFlow</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НастройкиОрганизацийДиадок/КонтурЛогистика_НастройкиОрганизацийДиадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НастройкиОрганизацийДиадок</name>
  <enumValues>
    <name>LogisticsApiKey</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытий</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДатаПЛ</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийСервисаФизическихЛицДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийПЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоказанияГСМВЭПЛ</name>
    <comment>Проверка наличия показаний ГСМ на выезде и заезде в сервисе</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеОтправительПутевогоЛиста</name>
    <comment>если отправитель = получателю в Диадоке</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеПолучательПутевогоЛиста</name>
    <comment>если отправитель = получателю в Диадоке</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеТрН</name>
  </enumValues>
  <enumValues>
    <name>РазрешитьВодителямВноситьПоказанияГСМ</name>
  </enumValues>
  <enumValues>
    <name>ЧитатьЛентуДиадок</name>
  </enumValues>
  <enumValues>
    <name>ЧитатьЛентуЛогистики</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДиадокДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДиадок</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

Функция АдресСервераСервисаФизическихЛиц() Экспорт
	
	ИспользоватьТестовыйСервер = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	
	URLАдреса_Контур = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.URLАдреса_Контур();
	
	Если ИспользоватьТестовыйСервер Тогда
		
		АдресТестовогоLogisticsAPI = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("АдресТестовогоLogisticsAPI");
		Если Найти(АдресТестовогоLogisticsAPI, "-staging") > 0 Тогда
			
			АдресСервера = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("АдресPersonsAPI");
			
			Если Не ЗначениеЗаполнено(АдресСервера) Тогда 
				АдресСервера = URLАдреса_Контур.СервисФизическихЛицAPI;
			КонецЕсли;
			
		Иначе
			
			АдресСервера = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("АдресТестовогоPersonsAPI");
			
			Если Не ЗначениеЗаполнено(АдресСервера) Тогда 
				АдресСервера = URLАдреса_Контур.СервисФизическихЛицТестовыйAPI;
			КонецЕсли;
			
		КонецЕсли;	
		
	Иначе
		
		АдресСервера = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("АдресPersonsAPI");
		Если Не ЗначениеЗаполнено(АдресСервера) Тогда 
			АдресСервера = URLАдреса_Контур.СервисФизическихЛицAPI;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресСервера) Тогда 
		
		ВызватьИсключение "Не указан " + ?(ИспользоватьТестовыйСервер, "тестовый", "") + " Адрес API сервиса физических лиц.";
		
	КонецЕсли;
	
	Возврат АдресСервера;
	
КонецФункции

Функция ПараметрыСервисаСервисаФизическихЛиц(ОрганизацияДиадокСсылка = Неопределено) Экспорт
	
	Результат = КонтурЛогистика_API_СервисФизическихЛиц.МанифестПараметрыСервиса(АдресСервераСервисаФизическихЛиц());
	
	ApiKey = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ApiKeyЛогистика(ОрганизацияДиадокСсылка);
	
	Если ЗначениеЗаполнено(ApiKey) Тогда
		Результат.Вставить("ApiKey", КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ApiKeyЛогистика(ОрганизацияДиадокСсылка));
		Результат.РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.ApiKey;
	ИначеЕсли Результат.РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow Тогда
		Если ЗначениеЗаполнено(ОрганизацияДиадокСсылка) Тогда
			ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСервер.ДанныеАутентификацииПоОрганизации(ОрганизацияДиадокСсылка);
		Иначе
			ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСервер.ДанныеАутентификацииЛюбойОрганизации();
		КонецЕсли;
		
		Результат.Токен = ДанныеАутентификации.ТокенДоступа;	
	КонецЕсли;
			 	
	Результат.Вставить("НастройкиПрокси", КонтурЛогистика_ОбщегоНазначенияКлиентСервер.НастройкиПрокси());
	
	Возврат Результат;
	
КонецФункции

Функция ДоступенСервисФизЛиц(Организация = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Организация) И Не Организация.Наш Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	ДоступныеОрганизации = ДоступныеОрганизацииДляСервисаФизЛиц(Организация);
		
	Возврат ДоступныеОрганизации.Количество() > 0;
	
КонецФункции

Функция ОрганизацияПоУмолчанию() Экспорт
	
	Организации = ДоступныеОрганизацииДляСервисаФизЛиц();
	
	Если Организации.Количество() = 1 Тогда
		Возврат Организации[0].Ссылка;
	Иначе
		Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеОрганизацииДляСервисаФизЛиц(Организация = Неопределено) Экспорт
	
	РежимАвторизации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимАвторизации"); 
	
	ДоступныеОрганизации = ДоступныеОрганизацииДляСервисаФизЛицПоApiKey(Организация);
	
	Если ДоступныеОрганизации.Количество() = 0 
		И РежимАвторизации = Перечисления.КонтурЛогистика_РежимыАвторизации.OIDCDeviceFlow Тогда
		
		ДоступныеОрганизацииПоOIDC = ДоступныеОрганизацииДляСервисаФизЛицПоOIDC(Организация);
		КонтурЛогистика_СтдОбщегоНазначенияКлиентСервер.ДополнитьМассивЛок(ДоступныеОрганизации, ДоступныеОрганизацииПоOIDC);;
				
	КонецЕсли;
			
	Возврат ДоступныеОрганизации;
		
КонецФункции

Функция ДоступныеОрганизацииДляСервисаФизЛицПоApiKey(Организация = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Организация
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_НастройкиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|		ПО (КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок = КонтурЛогистика_ОрганизацииДиадок.Ссылка)
		|ГДЕ
		|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
		|	И КонтурЛогистика_НастройкиОрганизаций.Настройка = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey)
		|	И КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки <> НЕОПРЕДЕЛЕНО
		|	И КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки <> """"
		|	И КонтурЛогистика_ОрганизацииДиадок.Наш
		|	И КонтурЛогистика_ОрганизацииДиадок.DirectoryId <> """"
		|	И (КонтурЛогистика_ОрганизацииДиадок.Перевозчик
		|			ИЛИ КонтурЛогистика_ОрганизацииДиадок.Оформитель)";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.Текст = Запрос.Текст + " И КонтурЛогистика_ОрганизацииДиадок.Ссылка = &Организация";
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
	
	Возврат Результат;	
	
КонецФункции

Функция ДоступныеОрганизацииДляСервисаФизЛицПоOIDC(Организация = Неопределено)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ДанныеАутентификации = КонтурЛогистика_ОбщегоНазначенияСервер.ДанныеАутентификацииПоОрганизации(Организация);
		Если ДанныеАутентификации.Успех Тогда
			Результат.Добавить(Организация);
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтурЛогистика_Аутентификация.Организация КАК Организация
			|ИЗ
			|	РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация
			|ГДЕ
			|	КонтурЛогистика_Аутентификация.ДатаОкончания > &ДатаОкончания
			|	И КонтурЛогистика_Аутентификация.Организация.Наш
			|	И НЕ КонтурЛогистика_Аутентификация.Организация.ПометкаУдаления
			|	И КонтурЛогистика_Аутентификация.Организация.DirectoryId <> """"
			|	И (КонтурЛогистика_Аутентификация.Организация.Перевозчик
			|			ИЛИ КонтурЛогистика_Аутентификация.Организация.Оформитель)
			|
			|СГРУППИРОВАТЬ ПО
			|	КонтурЛогистика_Аутентификация.Организация";
		
		Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДатаСеанса());
		
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
				
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти
